//
//  TaskTwoService.swift
//  iOSMobileArchitecture
//
//  Created by Andrey Chernyshev on 21/11/2018.
//  Copyright © 2018 Andrey Chernyshev. All rights reserved.
//

class TaskTwoService {
    
    // Добавить метод, возвращающий последовательность, используя оператор timer. Последовательность должна выполняться в главном потоке. Период установить 1 сек.
    
    // Добавить метод, возвращающий последовательность, используя оператор timer. Последовательность должна выполняться в бэкграунд потоке. Период установить 3 сек, задержку 0.5.
}
